app/Controllers/PemilihController.php

SELECT *
FROM `kecamatan`
SELECT *
FROM `desa`
WHERE `kecamatan_id` = '3'
---
    public function edit($id)
    {
        helper(['form']); // Memuat helper form
        $pemilihModel = new PemilihModel();
        $data['pemilih'] = $pemilihModel->getPemilih($id);

        // Ambil data kecamatan dan desa untuk dropdown
        $kecamatanModel = new KecamatanModel();
        $data['kecamatan'] = $kecamatanModel->findAll();

        // Ambil data desa untuk dropdown
        $desaModel = new DesaModel();
        $data['desa'] = $desaModel->where('kecamatan_id', $data['pemilih']['kecamatan_id'])->findAll();

SELECT *
FROM `kecamatan`
---
    public function get_kecamatan()
    {
        $kecamatanModel = new KecamatanModel();
        $kecamatan = $kecamatanModel->findAll();

SELECT *
FROM `desa`
WHERE `kecamatan_id` = '3'
---
    public function get_desa($kecamatanId)
    {
        $desaModel = new DesaModel();
        $desa = $desaModel->where('kecamatan_id', $kecamatanId)->findAll();