app/Models/PemilihModel.php

SELECT `pemilih`.*, `kecamatan`.`nama` as `nama_kecamatan`, `desa`.`nama` as `nama_desa`
FROM `pemilih`
JOIN `kecamatan` ON `kecamatan`.`id` = `pemilih`.`kecamatan_id`
JOIN `desa` ON `desa`.`id` = `pemilih`.`desa_id`
ORDER BY `id` DESC
---
    public function getAllData()
    {
        return $this->select('pemilih.*')
            ->select('kecamatan.nama as nama_kecamatan')
            ->select('desa.nama as nama_desa')
            ->join('kecamatan', 'kecamatan.id = pemilih.kecamatan_id')
            ->join('desa', 'desa.id = pemilih.desa_id')
            ->orderBy('id', 'DESC')
            ->findAll();

SELECT *
FROM `pemilih`
WHERE `pemilih`.`id` = '9'
---
    public function getPemilih($id = null)
    {
        if ($id === null) {
            return $this->findAll();
        }

        return $this->find($id);

INSERT INTO `pemilih` (`nama`, `nik`, `kecamatan_id`, `desa_id`, `tps`) VALUES ('Aldi', '321123234534534', '3', '24', '3')
---
    public function insertPemilih($data)
    {
        return $this->insert($data);

UPDATE `pemilih` SET `nama` = 'Aldi Miswa', `nik` = '321123234532323', `kecamatan_id` = '10', `desa_id` = '89', `tps` = '3'
WHERE `pemilih`.`id` IN ('9')
---
    public function updatePemilih($id, $data)
    {
        return $this->update($id, $data);

DELETE FROM `pemilih`
WHERE `id` IN ('4')
---
    public function deletePemilih($id)
    {
        return $this->delete($id);